Revit 2027 API
ParameterTypeId.FamilySelfOrienting Property
 "Align to View"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilySelfOrienting { get; }
Public Shared ReadOnly Property FamilySelfOrienting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilySelfOrienting {
	ForgeTypeId^ get ();
}
static member FamilySelfOrienting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace